#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 5 / 2;//商2余1
//	int b = 5 % 2;//取模时，左操作数，有操作数都必须是整数
//	double c = 5 / 2.0;//商2余1
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	printf("c=%lf\n", c);
//	return 0;
//}
//int main()
//{
//	int a = -1;
//	//
//	//正数的二进制有：原码、反码、补码
//	// 正数存储到内存中的是补码
//	// 100000000000000000000000000000000000001   -1原码
//	// 111111111111111111111111111111111111110   -1反码
//	// 111111111111111111111111111111111111111   -1补码
//	//----右移操作符，移动的是二进制位
//	//00000000000000000000000010000
//	//右移操作符：1.算术右移（右边丢弃，左边补原符号位），2.逻辑右移（右边丢弃，左边补0）
//	int b = a >> 2;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b= a << 1;
//	printf("b = %d\n", b);
//	return 0;
//	//左移操作符：
//	//左边丢弃，右边补0；
//}
//int main()
//{
	//int a = 3;
	//int b = 5;
	//int c = a & b;
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000001
	//操作都是补码进行操作
	//printf("c = %d\n", c);
	// |---按二进制位或
	//&---按二进制位与操作，移位操作符和位操作符只能作用于整数
		//int a = 3;
		//int b = 5;
		//int c = a | b;
		//printf("c = %d\n", c);
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	printf("c = %d\n", c);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int tmp = 0;//临时变量
//	printf("a = %d,b = %d\n", a, b);
//	tmp = a;
//	a = b;
//	b = tmp;
//	printf("a = %d,b = %d\n", a, b);
//	return 0;
//}


////int main()
////{
////	int a = 3;
////	int b = 5;
//
////加减法----可能会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	
//	//异或方法
////	a = a ^ b;
////	b = a ^ b;
////	a = a ^ b;
////
////	printf("a = %d,b = %d\n", a, b);
////	return 0;
////}
	//123，/10  %10
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d",&num);
//	//统计num的补码中有几个1
//	// 32bit
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000001
//	// 00000000000000000000000000000001
//	//while (num)
//	//{
//	//	if (num % 2 == 1)
//	//	{
//	//		count++;
//	//	}
//	//	num = num / 2;
//	//}
//
//	int i = 0;
//	for (i = 0;i < 32;i++)
//	{
//		if (1 == ((num >> i) & 1))
//			count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	a = a + 2;
//	a += 2;
//	a = a >> 1;
//	a >>= 1;
//	a = a & 1;
//	a &= 1;
//	return 0;
//}

int main()
{
	int a = 10;
	int* p = &a;//取地址操作符
	*p = 20;//解引用操作符
	return 0;
}

//数组类型，去掉名字就是类型