#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 10;//4
//	float f = 10.0;//4
//
//	return 0;
//}

//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是啥
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//
////判断是大端还是小端
//int check_sys()
//{
//	int a = 1;
//	char*p = (char*)&a;
//	return *p;
//}
////指针类型的意义有两个：
////指针类型决定了指针解引用操作符能访问几个字节，char*p,*p访问了1个字节，int*p,*p访问4个字节
////指针类型决定了指针+1，-1加的或者减的是几个字节,char *p;p+1代表跳过一个字符；int*p；p+1代表跳过一个整型，四个字节
//
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是啥
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret = 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//11111111111111111111111111111111
//	//11111111
//	//11111111111111111111111111111111
//	signed char b = -1;
//	//11111111
//	//11111111111111111111111111111111---有符号数补符号位    -1
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111---无符号数补0   255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	//1000000000000000000000010000000
//	//1111111111111111111111101111111
//	//1111111111111111111111110000000---补码
//	//10000000
//	//1111111111111111111111110000000---整型提升后得到补码，补码为无符号数。补码纪委原码
//	printf("%u\n", a);
//	//%d打印十进制的有符号数字
//	//%u打印十进制的无符号数字
//	return 0;
//}

//char
//signed char 
//unsigned char
//1个字节
//8个bit位
//有符号的char 的范围-128--127
//无符号的char 的范围  0 --255

//#include <stdio.h>
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}